---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCLevelInfo.DistanceToNextLevel
source: html/fa514233-5851-b663-852b-06a994323d98.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.DistanceToNextLevel Property

The distance to the next story level.

## Syntax (C#)
```csharp
public double DistanceToNextLevel { get; }
```